Revit 2024 API
ParameterTypeId.RepeatingDetailInside Property
 "Inside"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RepeatingDetailInside { get; }
Visual Basic
Public Shared ReadOnly Property RepeatingDetailInside As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RepeatingDetailInside {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace